# Pandas

In [49]:
import pandas as pd

1. Overview

In [50]:
df = pd.read_csv('data.csv')

In [51]:
df.head()

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [52]:
df.tail()

          Date Category  Value   Product  Sales Region
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

In [53]:
df.shape

(50, 6)

In [54]:
df.columns

Index(['Date', 'Category', 'Value', 'Product', 'Sales', 'Region'], dtype='object')

In [55]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      50 non-null     object
 1   Category  50 non-null     object
 2   Value     47 non-null     float64
 3   Product   50 non-null     object
 4   Sales     46 non-null     float64
 5   Region    50 non-null     object
dtypes: float64(2), object(4)
memory usage: 2.5+ KB

In [56]:
df.describe()

           Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000

2. Encoding

In [57]:
df['Category'].unique()

array(['A', 'B', 'C'], dtype=object)

In [58]:
df['Region'].unique()

array(['East', 'North', 'West', 'South'], dtype=object)

In [59]:
df['Region'].nunique()

4

In [60]:
df['Product'] = df['Product'].map({'Product1': 1, 'Product2': 2, 'Product3': 3})

In [61]:
df.head()

         Date Category  Value  Product  Sales Region
0  2023-01-01        A   28.0        1  754.0   East
1  2023-01-02        B   39.0        3  110.0  North
2  2023-01-03        C   32.0        2  398.0   East
3  2023-01-04        B    8.0        1  522.0   East
4  2023-01-05        B   26.0        3  869.0  North

In [62]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      50 non-null     object
 1   Category  50 non-null     object
 2   Value     47 non-null     float64
 3   Product   50 non-null     int64
 4   Sales     46 non-null     float64
 5   Region    50 non-null     object
dtypes: float64(2), int64(1), object(3)
memory usage: 2.5+ KB

3. Column Selection

In [63]:
cat = df['Category']

In [64]:
cat

0     A
1     B
2     C
3     B
4     B
5     B
6     A
7     C
8     C
9     A
10    B
11    B
12    A
13    A
14    A
15    C
16    C
17    C
18    A
19    A
20    C
21    C
22    B
23    C
24    A
25    C
26    C
27    C
28    B
29    C
30    B
31    A
32    B
33    C
34    C
35    B
36    C
37    C
38    C
39    A
40    B
41    C
42    A
43    A
44    A
45    B
46    B
47    B
48    C
49    C
Name: Category, dtype: object

In [65]:
col = df[['Category', 'Region']]

In [66]:
col

   Category Region
0         A   East
1         B  North
2         C   East
3         B   East
4         B  North
5         B   West
6         A   East
7         C   West
8         C   West
9         A   West
10        B  North
11        B   West
12        A  South
13        A   East
14        A   West
15        C  North
16        C  South
17        C   West
18        A   West
19        A   East
20        C  South
21        C  South
22        B  North
23        C   West
24        A   East
25        C   West
26        C  North
27        C  North
28        B  North
29        C  South
30        B   West
31        A   West
32        B  South
33        C   East
34        C   West
35        B   West
36        C   East
37        C  North
38        C  South
39        A   West
40        B   East
41        C   East
42        A   West
43        A   East
44        A   East
45        B   West
46        B  South
47        B   West
48        C  North
49        C  North

In [67]:
col_Cat_A = df[ df['Category'] == 'A' ]

In [68]:
col_Cat_A

          Date Category  Value  Product  Sales Region
0   2023-01-01        A   28.0        1  754.0   East
6   2023-01-07        A   16.0        1  936.0   East
9   2023-01-10        A   22.0        2  834.0   West
12  2023-01-13        A   70.0        3  628.0  South
13  2023-01-14        A   69.0        1  423.0   East
14  2023-01-15        A   47.0        2  893.0   West
18  2023-01-19        A   31.0        2  578.0   West
19  2023-01-20        A   59.0        1  736.0   East
24  2023-01-25        A   24.0        2  458.0   East
31  2023-02-01        A   17.0        2  189.0   West
39  2023-02-09        A   62.0        1  155.0   West
42  2023-02-12        A   93.0        3  164.0   West
43  2023-02-13        A   43.0        3  949.0   East
44  2023-02-14        A   96.0        3  830.0   East

In [69]:
df.head()

         Date Category  Value  Product  Sales Region
0  2023-01-01        A   28.0        1  754.0   East
1  2023-01-02        B   39.0        3  110.0  North
2  2023-01-03        C   32.0        2  398.0   East
3  2023-01-04        B    8.0        1  522.0   East
4  2023-01-05        B   26.0        3  869.0  North

In [70]:
df['Total_Sales'] = df['Value'] * df['Sales']

In [71]:
df.head()

         Date Category  Value  Product  Sales Region  Total_Sales
0  2023-01-01        A   28.0        1  754.0   East      21112.0
1  2023-01-02        B   39.0        3  110.0  North       4290.0
2  2023-01-03        C   32.0        2  398.0   East      12736.0
3  2023-01-04        B    8.0        1  522.0   East       4176.0
4  2023-01-05        B   26.0        3  869.0  North      22594.0

In [72]:
df.drop(['Sales','Date'],inplace=True, axis=1)

In [73]:
df.head()

  Category  Value  Product Region  Total_Sales
0        A   28.0        1   East      21112.0
1        B   39.0        3  North       4290.0
2        C   32.0        2   East      12736.0
3        B    8.0        1   East       4176.0
4        B   26.0        3  North      22594.0